In [ ]:
import os
import numpy as np
import pandas as pd
from sklearn import ensemble
from sklearn import model_selection,metrics,tree,preprocessing
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Dense,LSTM

## Paths

In [ ]:
TRAIN='/content/fulfilment_center_info.csv'
MEAL='/content/meal_info.csv'
CENTER='/content/train.csv'

## Reading the Files

In [ ]:
df_train=pd.read_csv(TRAIN)
df_train.head(10)

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6
5         64        553           77      TYPE_A      4.4
6        129        593           77      TYPE_A      3.9
7        139        693           34      TYPE_C      2.8
8         88        526           34      TYPE_A      4.1
9        143        562           77      TYPE_B      3.8

In [ ]:
df_meal=pd.read_csv(MEAL)
df_meal.head(10)

   meal_id   category  cuisine
0     1885  Beverages     Thai
1     1993  Beverages     Thai
2     2539  Beverages     Thai
3     1248  Beverages   Indian
4     2631  Beverages   Indian
5     1311     Extras     Thai
6     1062  Beverages  Italian
7     1778  Beverages  Italian
8     1803     Extras     Thai
9     1198     Extras     Thai

In [ ]:
df_center=pd.read_csv(CENTER)
df_center.head(10)

        id  week  ...  homepage_featured  num_orders
0  1379560     1  ...                  0         177
1  1466964     1  ...                  0         270
2  1346989     1  ...                  0         189
3  1338232     1  ...                  0          54
4  1448490     1  ...                  0          40
5  1270037     1  ...                  0          28
6  1191377     1  ...                  0         190
7  1499955     1  ...                  0         391
8  1025244     1  ...                  0         472
9  1054194     1  ...                  1         676

[10 rows x 9 columns]


### So Here We see that the main Aim is to calculate the no of orders
#### We can see that df_center could map the feature of meals from df_meal using the meal as the common key
#### Similarily We could all map the features of center to the the training set using center as the foreign key

## Drop Unnecessary Feature from center and map the Features from df_meal

In [ ]:
df_center=df_center.merge(df_meal,on='meal_id',how='inner')
df_center.head()

        id  week  center_id  ...  num_orders   category  cuisine
0  1379560     1         55  ...         177  Beverages     Thai
1  1040403     1         24  ...        1498  Beverages     Thai
2  1103215     1         11  ...         959  Beverages     Thai
3  1034383     1         83  ...        1025  Beverages     Thai
4  1118999     1         32  ...         445  Beverages     Thai

[5 rows x 11 columns]

In [ ]:
df_meall=df_meal.set_index('meal_id').T.to_dict()
print(df_meall)

{1885: {'category': 'Beverages', 'cuisine': 'Thai'}, 1993: {'category': 'Beverages', 'cuisine': 'Thai'}, 2539: {'category': 'Beverages', 'cuisine': 'Thai'}, 1248: {'category': 'Beverages', 'cuisine': 'Indian'}, 2631: {'category': 'Beverages', 'cuisine': 'Indian'}, 1311: {'category': 'Extras', 'cuisine': 'Thai'}, 1062: {'category': 'Beverages', 'cuisine': 'Italian'}, 1778: {'category': 'Beverages', 'cuisine': 'Italian'}, 1803: {'category': 'Extras', 'cuisine': 'Thai'}, 1198: {'category': 'Extras', 'cuisine': 'Thai'}, 2707: {'category': 'Beverages', 'cuisine': 'Italian'}, 1847: {'category': 'Soup', 'cuisine': 'Thai'}, 1438: {'category': 'Soup', 'cuisine': 'Thai'}, 2494: {'category': 'Soup', 'cuisine': 'Thai'}, 2760: {'category': 'Other Snacks', 'cuisine': 'Thai'}, 2490: {'category': 'Salad', 'cuisine': 'Italian'}, 1109: {'category': 'Rice Bowl', 'cuisine': 'Indian'}, 2290: {'category': 'Rice Bowl', 'cuisine': 'Indian'}, 1525: {'category': 'Other Snacks', 'cuisine': 'Thai'}, 2704: {'category': 'Other Snacks', 'cuisine': 'Thai'}, 1878: {'category': 'Starters', 'cuisine': 'Thai'}, 2640: {'category': 'Starters', 'cuisine': 'Thai'}, 2577: {'category': 'Starters', 'cuisine': 'Thai'}, 1754: {'category': 'Sandwich', 'cuisine': 'Italian'}, 1971: {'category': 'Sandwich', 'cuisine': 'Italian'}, 2306: {'category': 'Pasta', 'cuisine': 'Italian'}, 2139: {'category': 'Beverages', 'cuisine': 'Indian'}, 2826: {'category': 'Sandwich', 'cuisine': 'Italian'}, 2664: {'category': 'Salad', 'cuisine': 'Italian'}, 2569: {'category': 'Salad', 'cuisine': 'Italian'}, 1230: {'category': 'Beverages', 'cuisine': 'Continental'}, 1207: {'category': 'Beverages', 'cuisine': 'Continental'}, 2322: {'category': 'Beverages', 'cuisine': 'Continental'}, 2492: {'category': 'Desert', 'cuisine': 'Indian'}, 1216: {'category': 'Pasta', 'cuisine': 'Italian'}, 1727: {'category': 'Rice Bowl', 'cuisine': 'Indian'}, 1902: {'category': 'Biryani', 'cuisine': 'Indian'}, 1247: {'category': 'Biryani', 'cuisine': 'Indian'}, 2304: {'category': 'Desert', 'cuisine': 'Indian'}, 1543: {'category': 'Desert', 'cuisine': 'Indian'}, 1770: {'category': 'Biryani', 'cuisine': 'Indian'}, 2126: {'category': 'Pasta', 'cuisine': 'Italian'}, 1558: {'category': 'Pizza', 'cuisine': 'Continental'}, 2581: {'category': 'Pizza', 'cuisine': 'Continental'}, 1962: {'category': 'Pizza', 'cuisine': 'Continental'}, 1571: {'category': 'Fish', 'cuisine': 'Continental'}, 2956: {'category': 'Fish', 'cuisine': 'Continental'}, 2104: {'category': 'Fish', 'cuisine': 'Continental'}, 2444: {'category': 'Seafood', 'cuisine': 'Continental'}, 2867: {'category': 'Seafood', 'cuisine': 'Continental'}, 1445: {'category': 'Seafood', 'cuisine': 'Continental'}}

In [ ]:
df_center.drop('meal_id',axis=1,inplace=True)

In [ ]:
df_train=df_train.merge(df_center,on='center_id',how='inner')
df_train.head()

   center_id  city_code  region_code  ... num_orders   category  cuisine
0         11        679           56  ...        959  Beverages     Thai
1         11        679           56  ...       1054  Beverages     Thai
2         11        679           56  ...        891  Beverages     Thai
3         11        679           56  ...       1107  Beverages     Thai
4         11        679           56  ...        919  Beverages     Thai

[5 rows x 14 columns]

In [ ]:
df_train.drop(['center_id','city_code','region_code','id'],axis=1,inplace=True)
df_train.shape

(456548, 10)

In [ ]:
TEST='/content/test_QoiMO9B.csv'
df_test=pd.read_csv(TEST)
df_test.head(10)

        id  week  ...  emailer_for_promotion  homepage_featured
0  1028232   146  ...                      0                  0
1  1127204   146  ...                      0                  0
2  1212707   146  ...                      0                  0
3  1082698   146  ...                      0                  0
4  1400926   146  ...                      0                  0
5  1284113   146  ...                      0                  0
6  1197966   146  ...                      0                  0
7  1132739   146  ...                      0                  0
8  1057981   146  ...                      0                  0
9  1095932   146  ...                      0                  0

[10 rows x 8 columns]

In [ ]:
category=[]
cuisine=[]
meal=df_test['meal_id']
for i in meal:
  arr=df_meall[i]
  category.append(arr['category'])
  cuisine.append(arr['cuisine'])
df_test['category']=category
df_test['cuisine']=cuisine
df_test.drop('meal_id',axis=1,inplace=True)
df_test.head(10)

        id  week  center_id  ...  homepage_featured   category      cuisine
0  1028232   146         55  ...                  0  Beverages         Thai
1  1127204   146         55  ...                  0  Beverages         Thai
2  1212707   146         55  ...                  0  Beverages         Thai
3  1082698   146         55  ...                  0  Beverages       Indian
4  1400926   146         55  ...                  0  Beverages       Indian
5  1284113   146         55  ...                  0  Beverages      Italian
6  1197966   146         55  ...                  0  Beverages      Italian
7  1132739   146         55  ...                  0  Beverages      Italian
8  1057981   146         55  ...                  0  Beverages  Continental
9  1095932   146         55  ...                  0  Beverages  Continental

[10 rows x 9 columns]

In [ ]:
df_center=pd.read_csv(TRAIN)
df_center=df_center.set_index('center_id').T.to_dict()
len(df_center)

77

In [ ]:
center_type=[]
op_area=[]
center=df_test['center_id']
for i in center:
  arr=df_center[i]
  center_type.append(arr['center_type'])
  op_area.append(arr['op_area'])
df_test['center_type']=center_type
df_test['op_area']=op_area
df_test.drop('center_id',axis=1,inplace=True)
df_test.head(10)

        id  week  checkout_price  ...      cuisine  center_type  op_area
0  1028232   146          158.11  ...         Thai       TYPE_C      2.0
1  1127204   146          160.11  ...         Thai       TYPE_C      2.0
2  1212707   146          157.14  ...         Thai       TYPE_C      2.0
3  1082698   146          162.02  ...       Indian       TYPE_C      2.0
4  1400926   146          163.93  ...       Indian       TYPE_C      2.0
5  1284113   146          190.15  ...      Italian       TYPE_C      2.0
6  1197966   146          191.09  ...      Italian       TYPE_C      2.0
7  1132739   146          242.56  ...      Italian       TYPE_C      2.0
8  1057981   146          360.90  ...  Continental       TYPE_C      2.0
9  1095932   146          383.18  ...  Continental       TYPE_C      2.0

[10 rows x 10 columns]

In [ ]:
id=df_test['id']
df_test.drop('id',axis=1,inplace=True)
df_test.shape

(32573, 9)

In [ ]:
df_train.head(3)

  center_type  op_area  week  ...  num_orders   category  cuisine
0      TYPE_A      3.7     1  ...         959  Beverages     Thai
1      TYPE_A      3.7     2  ...        1054  Beverages     Thai
2      TYPE_A      3.7     3  ...         891  Beverages     Thai

[3 rows x 10 columns]

In [ ]:
df_test.head(3)

   week  checkout_price  base_price  ...  cuisine  center_type op_area
0   146          158.11      159.11  ...     Thai       TYPE_C     2.0
1   146          160.11      159.11  ...     Thai       TYPE_C     2.0
2   146          157.14      159.14  ...     Thai       TYPE_C     2.0

[3 rows x 9 columns]

In [188]:
df_train.to_csv('training_set.csv')
df_test.to_csv('testing_set.csv')
id.to_csv('test_ids.csv')